###############################################################################
# Created by write_sdc
###############################################################################
current_design pm32
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mc[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mp[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[32]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[33]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[34]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[35]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[36]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[37]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[38]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[39]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[40]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[41]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[42]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[43]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[44]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[45]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[46]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[47]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[48]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[49]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[50]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[51]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[52]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[53]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[54]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[55]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[56]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[57]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[58]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[59]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[60]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[61]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[62]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[63]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {p[63]}]
set_load -pin_load 0.0334 [get_ports {p[62]}]
set_load -pin_load 0.0334 [get_ports {p[61]}]
set_load -pin_load 0.0334 [get_ports {p[60]}]
set_load -pin_load 0.0334 [get_ports {p[59]}]
set_load -pin_load 0.0334 [get_ports {p[58]}]
set_load -pin_load 0.0334 [get_ports {p[57]}]
set_load -pin_load 0.0334 [get_ports {p[56]}]
set_load -pin_load 0.0334 [get_ports {p[55]}]
set_load -pin_load 0.0334 [get_ports {p[54]}]
set_load -pin_load 0.0334 [get_ports {p[53]}]
set_load -pin_load 0.0334 [get_ports {p[52]}]
set_load -pin_load 0.0334 [get_ports {p[51]}]
set_load -pin_load 0.0334 [get_ports {p[50]}]
set_load -pin_load 0.0334 [get_ports {p[49]}]
set_load -pin_load 0.0334 [get_ports {p[48]}]
set_load -pin_load 0.0334 [get_ports {p[47]}]
set_load -pin_load 0.0334 [get_ports {p[46]}]
set_load -pin_load 0.0334 [get_ports {p[45]}]
set_load -pin_load 0.0334 [get_ports {p[44]}]
set_load -pin_load 0.0334 [get_ports {p[43]}]
set_load -pin_load 0.0334 [get_ports {p[42]}]
set_load -pin_load 0.0334 [get_ports {p[41]}]
set_load -pin_load 0.0334 [get_ports {p[40]}]
set_load -pin_load 0.0334 [get_ports {p[39]}]
set_load -pin_load 0.0334 [get_ports {p[38]}]
set_load -pin_load 0.0334 [get_ports {p[37]}]
set_load -pin_load 0.0334 [get_ports {p[36]}]
set_load -pin_load 0.0334 [get_ports {p[35]}]
set_load -pin_load 0.0334 [get_ports {p[34]}]
set_load -pin_load 0.0334 [get_ports {p[33]}]
set_load -pin_load 0.0334 [get_ports {p[32]}]
set_load -pin_load 0.0334 [get_ports {p[31]}]
set_load -pin_load 0.0334 [get_ports {p[30]}]
set_load -pin_load 0.0334 [get_ports {p[29]}]
set_load -pin_load 0.0334 [get_ports {p[28]}]
set_load -pin_load 0.0334 [get_ports {p[27]}]
set_load -pin_load 0.0334 [get_ports {p[26]}]
set_load -pin_load 0.0334 [get_ports {p[25]}]
set_load -pin_load 0.0334 [get_ports {p[24]}]
set_load -pin_load 0.0334 [get_ports {p[23]}]
set_load -pin_load 0.0334 [get_ports {p[22]}]
set_load -pin_load 0.0334 [get_ports {p[21]}]
set_load -pin_load 0.0334 [get_ports {p[20]}]
set_load -pin_load 0.0334 [get_ports {p[19]}]
set_load -pin_load 0.0334 [get_ports {p[18]}]
set_load -pin_load 0.0334 [get_ports {p[17]}]
set_load -pin_load 0.0334 [get_ports {p[16]}]
set_load -pin_load 0.0334 [get_ports {p[15]}]
set_load -pin_load 0.0334 [get_ports {p[14]}]
set_load -pin_load 0.0334 [get_ports {p[13]}]
set_load -pin_load 0.0334 [get_ports {p[12]}]
set_load -pin_load 0.0334 [get_ports {p[11]}]
set_load -pin_load 0.0334 [get_ports {p[10]}]
set_load -pin_load 0.0334 [get_ports {p[9]}]
set_load -pin_load 0.0334 [get_ports {p[8]}]
set_load -pin_load 0.0334 [get_ports {p[7]}]
set_load -pin_load 0.0334 [get_ports {p[6]}]
set_load -pin_load 0.0334 [get_ports {p[5]}]
set_load -pin_load 0.0334 [get_ports {p[4]}]
set_load -pin_load 0.0334 [get_ports {p[3]}]
set_load -pin_load 0.0334 [get_ports {p[2]}]
set_load -pin_load 0.0334 [get_ports {p[1]}]
set_load -pin_load 0.0334 [get_ports {p[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mc[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mp[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
